# !/usr/bin/python
# -*- coding:UTF-8 -*-
# -----------------------------------------------------------------------#
# File Name: __init__.py
# Author: Junyi Li
# Mail: 4ljy@163.com
# Created Time: 2021-03-27
# Description:
#     我们把各个模块的训练都放在这里，这样就可以让人们很方便的进行调用了。
#     这里我们要做的事情主要是将对各个模块的训练的代码放在这里，目的：
#     1 很方便的把训练数据的路径以及模型的保存路径写入，就可以实现训练
#     2 在inference的时候把模型的路径写入到类的init的时候，就可以很方便的进行inference
#
#     TODO:
#     未来可以考虑一下速度上面的优化问题
# -----------------------------------------------------------------------#
